{"summary":{"by_priority":{"critical":7,"high":4,"low":1,"medium":1},"avg_confidence":0.8423076923076922,"total_feedback_items":556},"insights":[{"affected_users":"Arabic-speaking merchants across MENA region, particularly those using AI Product Description Generator and AI Tone Trainer for customer-facing content who need conversational, culturally appropriate Arabic rather than formal classical Arabic.","cluster_id":"Arabic Language & Localization Issues","confidence_score":0.87,"features":["F003","F004","F012","F011","F010"],"feedback_count":83,"feedback_ids":["FX001","FX004","FX005","FX006","FX008","FX009","FX014","FX017","FX018","FX019","FX020","FX022","FX023","FX026","FX028","FX030","FX034","FX035","FX036","FX038","FX046","FX047","FX056","FX058","FX059","FX061","FX063","FX064","FX071","FX079","FX080","FX081","FX082","FX084","FX087","FX092","FX094","FX096","CH006","CH007","CH022","CH025","CH027","CH035","CH042","CH052","CH056","CH058","CH059","CH060","CH071","CH077","CH079","CH080","CH081","CH084","CH086","CH089","CH094","CH099","NPS022","NPS026","NPS029","NPS035","NPS038","NPS039","NPS040","NPS043","NPS058","NPS060","NPS065","NPS066","NPS068","NPS071","NPS072","NPS073","NPS077","NPS088","INT03","INT04","INT05","INT06","INT07"],"impact":"Directly causing churn in Arabic-speaking markets (22 churn survey mentions), limiting market penetration in high-value MENA region, and blocking adoption of premium AI features among Arabic merchants who find the formal tone unusable for customer-facing content.","insight_summary":"83 customers have reported significant issues with Arabic language support, particularly around overly formal AI-generated content that doesn't match conversational tone expectations and inadequate multilingual capabilities. The feedback comes from diverse sources including 22 churn surveys, indicating this is actively driving customer loss. While sentiment is mixed (60%), the high urgency classification (23 high, 57 medium) and consistent themes across AI tools, localization, and support areas signal a systemic gap in Arabic market fit.","insight_title":"Arabic Localization Gaps Causing Customer Frustration and Churn","priority":"high","product_areas":["PA007","PA002","PA006"],"recommended_action":"Prioritize a two-phase approach: (1) Immediate - Train AI models to support conversational Arabic tone and add tone customization for formality levels in AI Tone Trainer; (2) Near-term - Hire Arabic-speaking UX writer and localization specialist to audit and improve Arabic content quality across Help Center, ensure RTL theme optimization, and implement proper dialect support for key markets (Gulf, Levantine, Egyptian).","sentiment_distribution":{"mixed":60,"negative":19,"neutral":2,"positive":2},"source_distribution":{"churn_survey":22,"feature_feedback":38,"nps_feedback":18,"user_interviews":5},"urgency_distribution":{"high":23,"low":3,"medium":57}},{"affected_users":"Users of AI Product Description Generator and AI content tools across multiple regions (including Arabic-speaking users), primarily merchants seeking brand-consistent content at scale","cluster_id":"AI Content Quality - Robotic & Formal Tone","confidence_score":0.85,"features":["F003","F004","F014"],"feedback_count":33,"feedback_ids":["FX002","FX007","FX010","FX011","FX013","FX015","FX016","FX024","FX029","FX031","FX039","FX040","FX041","FX044","FX045","FX049","FX051","FX052","FX053","FX054","FX057","FX062","FX067","FX068","FX069","FX072","FX085","FX086","FX088","FX089","FX093","FX097","FX099"],"impact":"Limiting adoption and sustained usage of AI content tools, potentially blocking conversion to paid tiers and reducing perceived ROI of AI features. Generic, robotic content fails to differentiate brands and may require significant manual editing, defeating the efficiency purpose.","insight_summary":"33 users report that AI-generated content sounds robotic, overly formal, and generic, failing to match their brand voice. The most frequently requested improvement across all feedback is the ability to train the AI on their specific tone and style. While users appreciate the ease of use and speed, the generic output quality is undermining the tool's value proposition.","insight_title":"AI-Generated Content Lacks Brand Voice Customization","priority":"high","product_areas":["PA002","PA007","PA008"],"recommended_action":"Prioritize development of the AI Tone Trainer feature (F004) to allow users to upload sample content and train the AI on their brand voice. Implement tone customization controls (formal/casual, playful/serious) as an interim solution while building the full training capability.","sentiment_distribution":{"mixed":33},"source_distribution":{"feature_feedback":33},"urgency_distribution":{"medium":33}},{"affected_users":"Users of AI-powered features across multiple segments, with specific impact on Arabic-speaking merchants attempting to use AI tools for multilingual content generation","cluster_id":"AI Content Relevance Issues","confidence_score":0.75,"features":["F003","F012","F004","F013","F014"],"feedback_count":20,"feedback_ids":["FX012","FX021","FX025","FX028","FX030","FX032","FX033","FX037","FX042","FX043","FX048","FX050","FX070","FX073","FX074","FX075","FX083","FX090","FX091","FX098"],"impact":"Undermining the value proposition of AI features, leading to reduced feature adoption and potential churn among users who expected reliable AI assistance. This particularly affects international expansion efforts in Arabic-speaking markets where localization quality is substandard.","insight_summary":"Twenty customers report that AI-generated suggestions and content are frequently irrelevant or inaccurate across multiple AI features, particularly the AI Product Description Generator. While users appreciate the time-saving potential and ease of use, the quality gaps are forcing manual corrections and reducing trust in AI outputs. Additionally, Arabic language support is notably poor, compounding relevance issues for non-English markets.","insight_title":"AI Suggestion Relevance Issues Affecting Core AI Tools","priority":"high","product_areas":["PA002","PA007","PA008"],"recommended_action":"Conduct AI model accuracy audit to identify relevance gaps, prioritize improving contextual understanding in AI Product Description Generator, and implement specialized Arabic language model training. Consider adding user feedback loops to continuously improve AI suggestion quality.","sentiment_distribution":{"mixed":20},"source_distribution":{"feature_feedback":20},"urgency_distribution":{"low":2,"medium":18}},{"affected_users":"Users across multiple product areas, particularly those attempting to use AI-powered features (AI Product Description Generator, AI Tone Trainer) and dashboard tools. Includes both English and Arabic-speaking merchants.","cluster_id":"Feature Discoverability & Dashboard Visibility","confidence_score":0.82,"features":["F003","F004","F014","F012","F005"],"feedback_count":30,"feedback_ids":["FX001","FX003","FX007","FX010","FX011","FX012","FX015","FX016","FX024","FX027","FX032","FX034","FX035","FX038","FX042","FX045","FX049","FX050","FX054","FX066","FX070","FX075","FX076","FX077","FX078","FX089","FX095","FX097","FX100","CH095"],"impact":"Reducing feature adoption rates and preventing users from realizing full product value, particularly for high-value AI capabilities. Low discoverability may be masking actual feature demand and limiting upsell opportunities for premium features.","insight_summary":"30 users report difficulty finding and enabling features across AI Tools, Reporting, and Localization areas, with \"hard to find where to enable it\" being a recurring pain point. While users appreciate the functionality once discovered (describing tools as \"easy to use and fast\" and \"saves me time\"), the initial discovery barrier is creating friction in feature adoption. This discoverability issue spans multiple critical features including AI Product Description Generator, AI Tone Trainer, and the Feedback Dashboard.","insight_title":"Poor Feature Discoverability Hindering AI Tools Adoption","priority":"high","product_areas":["PA002","PA007","PA008"],"recommended_action":"Conduct a UX audit of feature placement and onboarding flows, prioritizing AI Tools section. Implement progressive disclosure patterns, add contextual tooltips or guided tours for new features, and create a \"What's New\" or feature discovery section in the dashboard to highlight available capabilities.","sentiment_distribution":{"mixed":29,"negative":1},"source_distribution":{"churn_survey":1,"feature_feedback":29},"urgency_distribution":{"high":1,"low":2,"medium":27}},{"affected_users":"Small business owners, seasonal merchants, and trial users who didn't achieve sales during their trial period. Includes some MENA region merchants based on Arabic feedback patterns.","cluster_id":"Pricing & Value Concerns","confidence_score":0.85,"features":["F006","F009","F001","F002","F010"],"feedback_count":60,"feedback_ids":["CH004","CH005","CH013","CH014","CH020","CH021","CH023","CH024","CH027","CH028","CH032","CH033","CH034","CH037","CH038","CH039","CH040","CH041","CH042","CH045","CH046","CH048","CH049","CH050","CH051","CH052","CH061","CH062","CH070","CH073","CH075","CH076","CH077","CH082","CH083","CH085","CH086","CH087","CH089","CH096","CH097","CH100","CH168","CH169","NPS003","NPS007","NPS008","NPS010","NPS017","NPS018","NPS019","NPS030","NPS031","NPS045","NPS057","NPS067","NPS070","NPS075","NPS076","NPS081","NPS094","INT06"],"impact":"Driving significant churn (70% from churn surveys) and revenue loss, particularly among small merchants and seasonal businesses who represent a potentially large market segment. High urgency ratings (67%) indicate customers are making quick decisions to leave without alternatives.","insight_summary":"60 customers cited pricing and value concerns as a key factor in their churn decision, with 40 marking it as high urgency. The feedback reveals a gap in the product offering for small businesses and seasonal merchants who cannot justify monthly subscription costs, especially when they don't see immediate sales results post-trial. This is compounded by perception that current plans lack flexibility for businesses with variable revenue streams.","insight_title":"High Pricing Driving Churn Among Small and Seasonal Businesses","priority":"critical","product_areas":["PA004","PA006","PA007"],"recommended_action":"Introduce a flexible pricing tier for small/seasonal businesses (e.g., usage-based or pause-able subscription model) and improve trial-to-paid conversion by implementing proactive onboarding support during trial period to demonstrate value before first payment is due.","sentiment_distribution":{"mixed":20,"negative":39,"neutral":1},"source_distribution":{"churn_survey":42,"nps_feedback":17,"user_interviews":1},"urgency_distribution":{"high":40,"low":2,"medium":18}},{"affected_users":"New and existing customers across all segments, particularly those in setup/onboarding phase and those requiring payment gateway integration support. Affects both paying customers and trial users who didn't convert due to unresolved support issues.","cluster_id":"Support Response Time & Quality","confidence_score":0.92,"features":["F009","F001","F010","F006","F002"],"feedback_count":73,"feedback_ids":["CH001","CH002","CH003","CH004","CH007","CH009","CH010","CH012","CH016","CH017","CH019","CH021","CH028","CH030","CH031","CH033","CH036","CH037","CH038","CH040","CH041","CH043","CH046","CH047","CH048","CH049","CH050","CH053","CH054","CH061","CH062","CH063","CH066","CH067","CH074","CH079","CH080","CH081","CH083","CH088","CH090","CH091","CH092","CH098","CH153","CH157","NPS004","NPS006","NPS011","NPS013","NPS021","NPS027","NPS032","NPS033","NPS042","NPS044","NPS046","NPS051","NPS053","NPS069","NPS074","NPS078","NPS082","NPS084","NPS085","NPS089","NPS092","NPS095","NPS098","NPS100","INT01","INT02","INT04","INT06","INT07"],"impact":"Directly causing customer churn and competitive disadvantage, with customers explicitly citing slow support as their reason for switching to competitors like Shopify. This represents significant revenue loss and increased customer acquisition costs to replace churned users.","insight_summary":"73 customers have reported issues with slow support response times and inadequate support quality, with 44 mentions appearing in churn surveys indicating this is a primary reason for customer attrition. The problem spans multiple touchpoints including support chat, setup assistance, and help center resources. Customers describe support as \"friendly but slow to respond\" and are requesting \"faster support response\" as a critical improvement.","insight_title":"Poor Support Response Time Driving Customer Churn","priority":"critical","product_areas":["PA006","PA001","PA004"],"recommended_action":"Immediately audit current support response time SLAs and implement faster first-response targets. Expand support team capacity, enhance self-service resources (particularly for payment gateway setup), and establish a priority queue for customers in trial period or experiencing setup issues. Conduct root cause analysis on most common support tickets to reduce volume through proactive solutions.","sentiment_distribution":{"mixed":28,"negative":21,"positive":24},"source_distribution":{"churn_survey":44,"nps_feedback":24,"user_interviews":5},"urgency_distribution":{"high":45,"low":24,"medium":4}},{"affected_users":"E-commerce merchants during onboarding phase and existing customers requiring third-party integrations, spanning multiple regions including MENA market based on Arabic feedback","cluster_id":"Payment Gateway & Integration Issues","confidence_score":0.92,"features":["F002","F009","F001","F010","F006"],"feedback_count":40,"feedback_ids":["CH001","CH003","CH006","CH009","CH010","CH014","CH018","CH021","CH022","CH023","CH027","CH029","CH031","CH034","CH035","CH036","CH037","CH042","CH043","CH044","CH055","CH059","CH063","CH065","CH066","CH067","CH068","CH069","CH075","CH078","CH079","CH081","CH083","CH084","CH086","CH093","CH096","CH099","CH159","CH165","CH169","INT03","INT07"],"impact":"Directly causing customer churn with 38 lost customers explicitly attributing their departure to integration limitations and setup confusion. Revenue loss from churned accounts and negative word-of-mouth in competitive evaluations.","insight_summary":"40 customers cited payment gateway and integration issues as primary churn drivers, with 95% reporting high urgency and 80% expressing negative sentiment. The feedback reveals a dual problem: confusing payment gateway connection setup during onboarding and insufficient third-party integrations compared to competitors like Shopify. This is directly causing customers to switch platforms.","insight_title":"Payment Gateway Integration Complexity Driving High-Volume Churn","priority":"critical","product_areas":["PA001","PA006","PA005"],"recommended_action":"Immediately simplify payment gateway setup wizard with step-by-step guidance and visual indicators, expand integration marketplace with top 10 competitor integrations, and create localized setup documentation. Prioritize post-churn win-back campaign for the 38 affected customers once improvements are deployed.","sentiment_distribution":{"mixed":8,"negative":32},"source_distribution":{"churn_survey":38,"user_interviews":2},"urgency_distribution":{"high":37,"medium":3}},{"affected_users":"E-commerce merchants running promotional campaigns and sales events, with disproportionate impact on Arabic-speaking merchants in MENA region who experience performance issues during peak shopping periods","cluster_id":"Platform Performance & Stability","confidence_score":0.92,"features":["F005","F009","F001","F006","F010"],"feedback_count":32,"feedback_ids":["CH002","CH005","CH008","CH011","CH012","CH013","CH015","CH025","CH032","CH039","CH049","CH054","CH072","CH091","CH095","CH100","NPS001","NPS002","NPS014","NPS016","NPS028","NPS034","NPS036","NPS047","NPS049","NPS050","NPS052","NPS055","NPS059","NPS061","NPS087","NPS201","NPS202","INT03"],"impact":"Directly causing customer churn (16 churn survey mentions) with merchants switching to competitors due to technical reliability issues. Loss of revenue during peak sales periods when merchants need the platform most, severely damaging trust and brand reputation in MENA markets.","insight_summary":"32 customers report severe performance issues and platform slowdowns during promotional periods and peak sales events, with recurring complaints about system speed degradation. The issue is predominantly affecting merchants in Arabic-speaking markets during high-traffic periods and has directly contributed to technical-issue-related churn. With 28 high-urgency cases and 26 negative sentiment reports, this represents a critical infrastructure scalability gap.","insight_title":"Platform Performance Degradation During Sales Events Driving Critical Churn","priority":"critical","product_areas":["PA003","PA007","PA004"],"recommended_action":"Immediately conduct infrastructure performance audit focusing on load handling during promotional periods. Implement auto-scaling capabilities for high-traffic events and establish proactive monitoring for performance degradation. Create merchant communication protocol for planned high-load periods and offer performance SLAs for business-critical sales events.","sentiment_distribution":{"mixed":6,"negative":26},"source_distribution":{"churn_survey":16,"nps_feedback":15,"user_interviews":1},"urgency_distribution":{"high":28,"medium":4}},{"affected_users":"New customers during onboarding phase, particularly those setting up payment gateways and store configurations. Includes both self-serve users and those requiring localized support (Arabic-speaking merchants).","cluster_id":"Onboarding & Setup Complexity","confidence_score":0.85,"features":["F001","F009","F010","F002","F006"],"feedback_count":40,"feedback_ids":["CH004","CH006","CH007","CH008","CH010","CH011","CH015","CH016","CH018","CH019","CH022","CH026","CH028","CH034","CH042","CH045","CH048","CH050","CH055","CH056","CH060","CH064","CH065","CH071","CH075","CH078","CH079","CH086","CH088","CH091","CH092","CH093","CH094","CH096","CH099","INT01","INT02","INT03","INT04","INT05"],"impact":"Driving significant customer churn during trial and early adoption phases. 35 out of 40 mentions came from churn surveys, directly linking setup complexity to revenue loss and failed conversions from trial to paid subscriptions.","insight_summary":"40 customers cited confusing setup processes as a primary reason for churning, with payment gateway configuration being particularly problematic. 87.5% of feedback came from churn surveys, indicating setup complexity is directly contributing to customer loss. Users are struggling with inadequate guidance during critical onboarding steps, leading to poor initial experiences and early abandonment.","insight_title":"Complex Onboarding and Setup Process Driving High Churn","priority":"critical","product_areas":["PA001","PA006","PA007"],"recommended_action":"Redesign the Setup Wizard (F001) with step-by-step visual guidance for payment gateway configuration. Create interactive tutorials for critical setup steps and implement in-app contextual help. Prioritize localized help articles for non-English speaking markets to reduce support dependency.","sentiment_distribution":{"mixed":14,"negative":26},"source_distribution":{"churn_survey":35,"user_interviews":5},"urgency_distribution":{"high":33,"low":1,"medium":6}},{"affected_users":"Merchants using AI content generation tools, with notable representation from Arabic-speaking users who find the formal tone particularly problematic for their market context","cluster_id":"Positive Feedback - AI Productivity & Time Savings","confidence_score":0.75,"features":["F003","F004","F012","F014","F013"],"feedback_count":24,"feedback_ids":["FX001","FX003","FX014","FX025","FX029","FX039","FX040","FX041","FX044","FX073","FX074","FX075","FX091","FX095","FX098","NPS005","NPS012","NPS015","NPS041","NPS056","NPS062","NPS086","NPS097","NPS099","NPS205"],"impact":"Limiting adoption and full utilization of AI features that could drive Pro tier upgrades and differentiate the product. The discoverability issue prevents new users from experiencing value quickly, while tone formality reduces output quality and user satisfaction, potentially limiting word-of-mouth growth.","insight_summary":"24 users report that AI product description and content generation tools are delivering significant time savings and productivity benefits. However, users consistently cite two friction points: the AI output is too formal/robotic (particularly noted by Arabic-speaking users), and the features are difficult to discover within the product interface. Despite these issues, the positive reception indicates strong product-market fit for AI functionality.","insight_title":"AI Tools Driving Productivity Gains But Hindered by Tone Formality and Discoverability Issues","priority":"medium","product_areas":["PA002","PA007","PA008"],"recommended_action":"1) Implement the AI Tone Trainer feature (F004) to allow users to customize formality levels and writing style, prioritizing Arabic language support. 2) Improve feature discoverability through onboarding tooltips, in-product placement optimization, and contextual prompts when users create product descriptions.","sentiment_distribution":{"mixed":16,"positive":8},"source_distribution":{"feature_feedback":15,"nps_feedback":9},"urgency_distribution":{"low":9,"medium":15}},{"affected_users":"Multi-lingual merchants using Store Management and Localization features, including Arabic-speaking users benefiting from RTL support and users across different language markets utilizing the Language Switcher and improved Setup Wizard","cluster_id":"Positive Feedback - Platform Improvements","confidence_score":0.75,"features":["F011","F012","F001"],"feedback_count":18,"feedback_ids":["NPS009","NPS020","NPS023","NPS024","NPS025","NPS037","NPS043","NPS048","NPS054","NPS063","NPS064","NPS079","NPS080","NPS083","NPS090","NPS091","NPS093","NPS096","NPS209","NPS220","NPS223","NPS224","NPS225"],"impact":"Strengthening user satisfaction and retention across key markets, particularly among users leveraging localization features. This positive sentiment can drive NPS scores higher, reduce churn risk, and create opportunities for referrals and positive reviews that support growth in MENA and international markets.","insight_summary":"18 users across both Arabic and English-speaking markets have reported significantly improved user experience and system performance following recent platform updates. The positive feedback is concentrated around Store Management, Localization features (Arabic RTL Theme and Language Switcher), and the Setup Wizard, indicating that recent improvements to these areas are resonating well with users. This represents a clear validation of recent development efforts and suggests these features are meeting user expectations.","insight_title":"Recent Platform Updates Driving Strong User Satisfaction","priority":"low","product_areas":["PA003","PA007","PA001"],"recommended_action":"Document the specific improvements that drove this positive response to inform future development priorities. Share this success internally with product and engineering teams, and consider case studies or testimonials from satisfied users to leverage in marketing materials. Continue monitoring these features to maintain quality standards.","sentiment_distribution":{"mixed":5,"positive":13},"source_distribution":{"nps_feedback":18},"urgency_distribution":{"low":16,"medium":2}},{"affected_users":"Small store owners, seasonal businesses, and merchants with occasional/infrequent usage needs who cannot justify fixed monthly costs without guaranteed sales results","cluster_id":"Trial Period & ROI Concerns","confidence_score":0.85,"features":["F006","F001","F009","F013","F005"],"feedback_count":23,"feedback_ids":["CH004","CH014","CH017","CH020","CH024","CH026","CH032","CH039","CH040","CH045","CH046","CH051","CH057","CH060","CH064","CH070","CH072","CH073","CH076","CH082","CH085","CH087","CH097","CH120","CH126","CH151","CH157","CH164"],"impact":"Driving significant trial-to-paid conversion failure and churn among small stores and seasonal businesses. Loss of 23 customers represents direct revenue impact and indicates a systematic pricing/value alignment issue affecting customer acquisition costs and lifetime value metrics.","insight_summary":"23 customers churned after trial periods citing lack of sales results and unwillingness to commit to monthly payments without proven ROI. Many merchants, particularly those with seasonal or occasional needs, find the current pricing structure unsuitable for their business model. The feedback indicates users appreciate the platform but require flexible pricing options aligned with actual usage and revenue generation.","insight_title":"Trial Period Churn Due to Unrealized Sales and Rigid Pricing Model","priority":"critical","product_areas":["PA004","PA003","PA006"],"recommended_action":"Introduce flexible pricing tier options including: (1) usage-based or pay-as-you-go plan for seasonal merchants, (2) lower-cost starter plan for small stores, and (3) extended trial period with onboarding support to help merchants achieve first sales. Implement performance analytics dashboard to demonstrate ROI during trial.","sentiment_distribution":{"mixed":13,"negative":10},"source_distribution":{"churn_survey":23},"urgency_distribution":{"high":10,"low":2,"medium":11}},{"affected_users":"Product teams, customer success teams, and cross-functional stakeholders who need to analyze and act on customer feedback but lack proper tooling for qualitative data analysis and insight sharing","cluster_id":"Feedback Management & Analysis System Needs","confidence_score":0.85,"features":["F014","F003","F013"],"feedback_count":80,"feedback_ids":["PV001","PV002","PV003","PV004","PV005","PV006","PV007","PV008","PV009","PV010","PV011","PV012","PV013","PV014","PV015","PV016","PV017","PV018","PV019","PV020","PV021","PV022","PV023","PV024","PV025","PV026","PV027","PV028","PV029","PV030","PV031","PV032","PV033","PV034","PV035","PV036","PV037","PV038","PV039","PV040","PV041","PV042","PV043","PV044","PV045","PV046","PV047","PV048","PV049","PV050","PV051","PV052","PV053","PV054","PV055","PV056","PV057","PV058","PV059","PV060","PV061","PV062","PV063","PV064","PV065","PV066","PV067","PV068","PV069","PV070","PV071","PV072","PV073","PV074","PV075","PV076","PV077","PV078","PV079","PV080","PV301"],"impact":"Preventing data-driven product decisions, causing inefficient resource allocation, and missing critical customer signals that could inform roadmap priorities. Teams unable to demonstrate ROI on customer feedback collection efforts.","insight_summary":"80 customers report struggling with scattered feedback across multiple tools (Google Sheets, Slack, Airtable, Notion) with no systematic way to analyze qualitative data or share insights across teams. Teams are currently relying on manual processes and team memory, making it impossible to identify recurring patterns or prioritize product decisions effectively. This represents a critical gap in product intelligence infrastructure.","insight_title":"Lack of Centralized Feedback Management System Blocking Product Intelligence","priority":"critical","product_areas":["PA008","PA002","PA005"],"recommended_action":"Prioritize development of AI-powered feedback clustering system with automated insight generation and cross-team collaboration features. Build centralized dashboard (F014) that unifies feedback sources and surfaces recurring themes. Consider this a foundational capability for PA008: Reporting & Insights roadmap.","sentiment_distribution":{"negative":78,"neutral":2},"source_distribution":{"problem_validation":80},"urgency_distribution":{"high":56,"medium":24}}],"generated_at":"2025-11-13T11:30:15.125000Z","total_insights":13}